Revit 2027 API
XYZ.Addition Operator
Adds the two specified vectors and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static XYZ operator +(
	XYZ left,
	XYZ right
)
Public Shared Operator + (
	left As XYZ,
	right As XYZ
) As XYZ
public:
static XYZ^ operator +(
	XYZ^ left,
	XYZ^ right
)
static let inline (+)
        left : XYZ *
        right : XYZ  : XYZ
Parameters
left XYZ
The first vector.
right XYZ
The second vector.
Return Value
XYZ
The vector equal to the sum of the two source vectors.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when left or right is null.
Remarks
 The added vector is obtained by adding each coordinate of the right vector to the corresponding coordinate of the left vector.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace